app/controllers/photos_controller.rb

INSERT INTO `photos` (`created_at`, `file_content_type`, `file_file_size`, `updated_at`, `file_file_name`, `file_updated_at`) VALUES('2010-10-11 03:39:04', 'image/jpeg', 148858, '2010-10-11 03:39:04', 'large_K0Wi_2g198120.jpg', '2010-10-11 03:39:03')
---
  def create
    @photo = Photo.new(:swfupload_file => params[:Filedata])
    if @photo.save